# Sales data at a French bakery

This data is from Kaggle:
https://www.kaggle.com/datasets/matthieugimbert/french-bakery-daily-sales?resource=download

#### Importing the data

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv(r"C:\Users\georg\Desktop\Data Centre\DataPython\Projects\Bakery Sales Data\Bakery sales unclean.csv")

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234005 entries, 0 to 234004
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     234005 non-null  int64
 1   date           234005 non-null  object
 2   time           234005 non-null  object
 3   ticket_number  234005 non-null  float64
 4   article        234005 non-null  object
 5   Quantity       234005 non-null  float64
 6   unit_price     234005 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 12.5+ MB

In [4]:
data.head(5)

,Unnamed: 0,date,time,ticket_number,article,Quantity,unit_price
0,0,2021-01-02,08:38,150040.0,BAGUETTE,1.0,"0,90 €"
1,1,2021-01-02,08:38,150040.0,PAIN AU CHOCOLAT,3.0,"1,20 €"
2,4,2021-01-02,09:14,150041.0,PAIN AU CHOCOLAT,2.0,"1,20 €"
3,5,2021-01-02,09:14,150041.0,PAIN,1.0,"1,15 €"
4,8,2021-01-02,09:25,150042.0,TRADITIONAL BAGUETTE,5.0,"1,20 €"

#### Data Cleaning

To be cleaned:
1. Checking for null values and decide whether or not it's suitable for analysis.
2. Column naming tidied.
3. Drop index column.
4. Date column format changed from object to suitable quantifiable format.
5. Time column format changed from object to suitable quantifiable format.
6. Ticket number changed from float to an integer.
7. Quantity changed from float to an integer.
8. Price column format changed from object to suitable quantifiable format.

1.

In [5]:
def null_values(data):
    null_count = data.isnull().sum()
    null_data = pd.DataFrame({'Column': null_count.index, 'Null values': null_count.values})
    return null_data

In [6]:
null = null_values(data)
print(null)

          Column  Null values
0     Unnamed: 0            0
1           date            0
2           time            0
3  ticket_number            0
4        article            0
5       Quantity            0
6     unit_price            0

2.

In [7]:
renamed = {"date": "Date", "time": "Time", "ticket_number": "Ticket_number", "article": "Product", "unit_price": "Euros" }

In [8]:
data.rename(columns = renamed, inplace = True)

In [9]:
data.head(5)

,Unnamed: 0,Date,Time,Ticket_number,Product,Quantity,Euros
0,0,2021-01-02,08:38,150040.0,BAGUETTE,1.0,"0,90 €"
1,1,2021-01-02,08:38,150040.0,PAIN AU CHOCOLAT,3.0,"1,20 €"
2,4,2021-01-02,09:14,150041.0,PAIN AU CHOCOLAT,2.0,"1,20 €"
3,5,2021-01-02,09:14,150041.0,PAIN,1.0,"1,15 €"
4,8,2021-01-02,09:25,150042.0,TRADITIONAL BAGUETTE,5.0,"1,20 €"

3.

In [10]:
data.drop("Unnamed: 0", axis = 1, inplace = True)

In [11]:
data.columns

Index(['Date', 'Time', 'Ticket_number', 'Product', 'Quantity', 'Euros'], dtype='object')

4.

In [12]:
data['Date'] = pd.to_datetime(data['Date'])

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234005 entries, 0 to 234004
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Date           234005 non-null  datetime64[ns]
 1   Time           234005 non-null  object
 2   Ticket_number  234005 non-null  float64
 3   Product        234005 non-null  object
 4   Quantity       234005 non-null  float64
 5   Euros          234005 non-null  object
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 10.7+ MB

5.

In [14]:
data["Time"] = pd.to_datetime(data["Time"], format="%H:%M").dt.strftime("%H%M").astype(int)

In [15]:
data.head()

        Date  Time  Ticket_number               Product  Quantity   Euros
0 2021-01-02   838       150040.0              BAGUETTE       1.0  0,90 €
1 2021-01-02   838       150040.0      PAIN AU CHOCOLAT       3.0  1,20 €
2 2021-01-02   914       150041.0      PAIN AU CHOCOLAT       2.0  1,20 €
3 2021-01-02   914       150041.0                  PAIN       1.0  1,15 €
4 2021-01-02   925       150042.0  TRADITIONAL BAGUETTE       5.0  1,20 €

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234005 entries, 0 to 234004
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Date           234005 non-null  datetime64[ns]
 1   Time           234005 non-null  int32
 2   Ticket_number  234005 non-null  float64
 3   Product        234005 non-null  object
 4   Quantity       234005 non-null  float64
 5   Euros          234005 non-null  object
dtypes: datetime64[ns](1), float64(2), int32(1), object(2)
memory usage: 9.8+ MB

6.

In [17]:
data["Ticket_number"] = data["Ticket_number"].astype(int)

In [18]:
data.head()

        Date  Time  Ticket_number               Product  Quantity   Euros
0 2021-01-02   838         150040              BAGUETTE       1.0  0,90 €
1 2021-01-02   838         150040      PAIN AU CHOCOLAT       3.0  1,20 €
2 2021-01-02   914         150041      PAIN AU CHOCOLAT       2.0  1,20 €
3 2021-01-02   914         150041                  PAIN       1.0  1,15 €
4 2021-01-02   925         150042  TRADITIONAL BAGUETTE       5.0  1,20 €

7.

In [19]:
data["Quantity"] = data["Quantity"].astype(int)

In [20]:
data.head()

        Date  Time  Ticket_number               Product  Quantity   Euros
0 2021-01-02   838         150040              BAGUETTE         1  0,90 €
1 2021-01-02   838         150040      PAIN AU CHOCOLAT         3  1,20 €
2 2021-01-02   914         150041      PAIN AU CHOCOLAT         2  1,20 €
3 2021-01-02   914         150041                  PAIN         1  1,15 €
4 2021-01-02   925         150042  TRADITIONAL BAGUETTE         5  1,20 €

8.

In [21]:
data["Euros"] = data["Euros"].str[:-2]

In [22]:
data["Euros"] = data["Euros"].str.replace(',', '.')

In [23]:
data["Euros"] = data["Euros"].astype(float)

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234005 entries, 0 to 234004
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Date           234005 non-null  datetime64[ns]
 1   Time           234005 non-null  int32
 2   Ticket_number  234005 non-null  int32
 3   Product        234005 non-null  object
 4   Quantity       234005 non-null  int32
 5   Euros          234005 non-null  float64
dtypes: datetime64[ns](1), float64(1), int32(3), object(1)
memory usage: 8.0+ MB

In [25]:
data.head()

        Date  Time  Ticket_number               Product  Quantity  Euros
0 2021-01-02   838         150040              BAGUETTE         1   0.90
1 2021-01-02   838         150040      PAIN AU CHOCOLAT         3   1.20
2 2021-01-02   914         150041      PAIN AU CHOCOLAT         2   1.20
3 2021-01-02   914         150041                  PAIN         1   1.15
4 2021-01-02   925         150042  TRADITIONAL BAGUETTE         5   1.20

Clean notes:

5. Time column format changed from object to suitable quantifiable format.
    Formatting an issue with attempting to achieve HH:MM format with a quantifiable data type, workaround found. 

Everything else completed as planned. 



Data is now ready for some EDA in SQL, I will save this dataset to a CSV file.

In [26]:
data.to_csv(r"C:\Users\georg\Desktop\Data Centre\DataPython\Projects\Bakery Sales Data\Bakery sales.csv")